Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/WBZ450/include/component/rcon.h
#define RCON_RNMICONINV_Msk                   _UINT32_(0x00000000)                                 /* (RCON_RNMICONINV) Register Mask  */


/** \brief RCON register offsets definitions */
#define RCON_RCON_REG_OFST             _UINT32_(0x30)      /* (RCON_RCON) RESET CONTROL REGISTER Offset */
#define RCON_RCONCLR_REG_OFST          _UINT32_(0x34)      /* (RCON_RCONCLR)  Offset */
#define RCON_RCONSET_REG_OFST          _UINT32_(0x38)      /* (RCON_RCONSET)  Offset */
#define RCON_RCONINV_REG_OFST          _UINT32_(0x3C)      /* (RCON_RCONINV)  Offset */
#define RCON_RSWRST_REG_OFST           _UINT32_(0x40)      /* (RCON_RSWRST) SOFTWARE RESET REGISTER Offset */
#define RCON_RSWRSTCLR_REG_OFST        _UINT32_(0x44)      /* (RCON_RSWRSTCLR)  Offset */
#define RCON_RSWRSTSET_REG_OFST        _UINT32_(0x48)      /* (RCON_RSWRSTSET)  Offset */
#define RCON_RSWRSTINV_REG_OFST        _UINT32_(0x4C)      /* (RCON_RSWRSTINV)  Offset */
#define RCON_RNMICON_REG_OFST          _UINT32_(0x50)      /* (RCON_RNMICON) NMI CONTROL REGISTER Offset */
#define RCON_RNMICONCLR_REG_OFST       _UINT32_(0x54)      /* (RCON_RNMICONCLR)  Offset */
#define RCON_RNMICONSET_REG_OFST       _UINT32_(0x58)      /* (RCON_RNMICONSET)  Offset */
#define RCON_RNMICONINV_REG_OFST       _UINT32_(0x5C)      /* (RCON_RNMICONINV)  Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief RCON register API structure */
typedef struct
{  /*  */
  __I   uint8_t                        Reserved1[0x30];
  __IO  uint32_t                       RCON_RCON;          /**< Offset: 0x30 (R/W  32) RESET CONTROL REGISTER */
  __IO  uint32_t                       RCON_RCONCLR;       /**< Offset: 0x34 (R/W  32)  */
  __IO  uint32_t                       RCON_RCONSET;       /**< Offset: 0x38 (R/W  32)  */
  __IO  uint32_t                       RCON_RCONINV;       /**< Offset: 0x3C (R/W  32)  */
  __O   uint32_t                       RCON_RSWRST;        /**< Offset: 0x40 ( /W  32) SOFTWARE RESET REGISTER */
  __IO  uint32_t                       RCON_RSWRSTCLR;     /**< Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       RCON_RSWRSTSET;     /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       RCON_RSWRSTINV;     /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       RCON_RNMICON;       /**< Offset: 0x50 (R/W  32) NMI CONTROL REGISTER */
  __IO  uint32_t                       RCON_RNMICONCLR;    /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       RCON_RNMICONSET;    /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       RCON_RNMICONINV;    /**< Offset: 0x5C (R/W  32)  */
} rcon_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ45_RCON_COMPONENT_H_ */
